Autodesk.Revit.DB.ScheduleField.HasTotals
Indicates if the field displays totals.
Remarks:
To display totals below a series of schedule rows, a footer row must be
enabled where the totals will be displayed.  It can either be a grand total
row at the end of the schedule or a footer row for one of the schedule's
grouped fields.
In a non-itemized schedule, totals are also displayed in regular rows
when multiple elements appear on the same row.
True if the field displays totals, false otherwise.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This ScheduleField cannot be totaled.
Since:
2013